

indices = """1. 门诊预约服务（专家号） - 100000001
2. 门诊预约服务（动态心电图） - 100000002
3. 门诊预约服务（动态血压） - 100000003
4. 门诊导医台（一站式服务中心） - 100000004
5. 导医热线（工作日） - 100000005
6. 门诊药房 - 100000006
7. 病案室 - 100000007
8. 病案室1 - 100000008
9. 发热门诊 - 100000009
10. 门诊二楼挂号收费 - 100000010
11. 专家门诊护士站 - 100000011
12. 普外 - 100000012
13. 中医 - 100000013
14. 核医学 - 100000014
15. 肿瘤外科 - 100000015
16. 骨科 - 100000016
17. 甲乳科 - 100000017
18. 肾内科 - 100000018
19. 内分泌科 - 100000019
20. 风湿免疫科 - 100000020
21. 血液科 - 100000021
22. 呼吸内科 - 100000022
23. 感染性疾病科 - 100000023
24. 神内 - 100000024
25. 神外 - 100000025
26. 心血管内 - 100000026
27. 外科 - 100000027
28. 老年医学科 - 100000028
29. 血管外科 - 100000029
30. 介入科 - 100000030
31. B超 - 100000031
32. 心电图 - 100000032
33. 消化内镜中心 - 100000033
34. 消化内科 - 100000034
35. 耳鼻喉科 - 100000035
36. 泌尿外科 - 100000036
37. 妇科 - 100000037
38. 产科 - 100000038
39. 口腔科 - 100000039
40. 疼痛 - 100000040
41. 皮肤 - 100000041
42. 眼科 - 100000042
43. 急诊挂号收费 - 100000043
44. 急诊预检台（急诊） - 100000044
45. 急诊抢救室 - 100000045
46. 急诊药房 - 100000046
47. 急诊心电图 - 100000047
48. 急诊检验 - 100000048
49. 急诊B超 - 100000049
50. 儿科门诊预检台 - 100000050
51. 儿科输液室 - 100000051
52. 儿科挂号收费 - 100000052
53. 总值班室 - 100000053
54. 成人输液室 - 100000054
55. 急诊内科120病房 - 100000055
56. 急诊ICU - 100000056
57. 标本接收处 - 100000057
58. CT登记处取片 - 100000058
59. 核磁共振登记处 - 100000059
60. 病理科登记室 - 100000060
61. 出院处窗口 - 100000061
62. 核医学科502区护士站 - 100000062
63. 感染性疾病科601区护士站 - 100000063
64. 神经外科602区护士站 - 100000064
65. ICU2室护士站 - 100000065
66. ICU3室护士站 - 100000066
67. ICU1室护士站 - 100000067
68. ICU5室护士站 - 100000068
69. CCU护士站 - 100000069
70. CCU2室护士站 - 100000070
71. 手外科604区护士站 - 100000071
72. 整形烧伤科604区护士站 - 100000072
73. 骨科605区护士站（运动关节） - 100000073
74. 骨科605区护士站（运动损伤） - 100000074
75. 骨科605区护士站（关节扭伤） - 100000075
76. 骨科606区护士站（脊柱损伤） - 100000076
77. 骨科607区护士站（骨创伤） - 100000077
78. 骨科607区护士站（四肢骨折） - 100000078
79. 骨科607区护士站（关节置换） - 100000079
80. 疼痛科701区护士站 - 100000080
81. 妇科702区护士站 - 100000081
82. 产科702区护士站 - 100000082
83. 泌尿外科705区护士站 - 100000083
84. 泌尿外科706区护士站 - 100000084
85. 普外科707区护士站(胃肠外科) - 100000085
86. 普外科708区护士站（肝胆胰外科） - 100000086
87. 眼科709区护士站 - 100000087
88. 耳鼻喉科709区护士站 - 100000088
89. 口腔科709区护士站 - 100000089
90. 本部体检中心服务台 - 100000090
91. 体检中心团队接待室 - 100000091
92. DSA室登记处 - 100000092
93. 儿科802B区护士站 - 100000093
94. 介入科802A区护士站 - 100000094
95. 血液科803B区护士站 - 100000095
96. 风湿免疫科803A区护士站 - 100000096
97. 血透室护士站 - 100000097
98. 肾内科804B区护士站 - 100000098
99. 呼吸科805A区护士站 - 100000099
100. 呼吸科805B区护士站 - 100000100
101. 神经内科806A区护士站 - 100000101
102. 神经内科806B区护士站 - 100000102
103. 肿瘤内科807A区护士站 - 100000103
104. 肿瘤内科807B区护士站 - 100000104
105. 消化内科808区护士站 - 100000105
106. 老年医学科809区护士站（干部病房） - 100000106
107. 心内科903区护士站 - 100000107
108. 心内科904区护士站 - 100000108
109. 心内科905区护士站 - 100000109
110. 心胸外科906区护士站 - 100000110
111. 心胸外科907区护士站 - 100000111
112. 心内科1004区护士站 - 100000112
113. 心内科1005区护士站 - 100000113
114. 心胸外科1006区护士站 - 100000114
115. 河西放射科登记处 - 100000115
116. 河西院区门诊服务台 - 100000116
117. 河西急诊预检 - 100000117
118. 河西急诊抢救室 - 100000118
119. 河西急诊检验科 - 100000119
120. 河西成人输液室 - 100000120
121. 河西急诊收费处 - 100000121
122. 河西急诊病房护士站 - 100000122
123. 河西急诊药房 - 100000123
124. 河西门诊药房 - 100000124
125. 河西普通门诊护士站 - 100000125
126. 河西外科门诊 - 100000126
127. 河西儿科护士站 - 100000127
128. 河西功能检查护士站 - 100000128
129. 河西挂号收费2 - 100000129
130. 河西门诊检验 - 100000130
131. 门诊办公室 - 100000131
132. 动态心电图室 - 100000132
133. 心血管超声室 - 100000133
134. 医保窗口 - 100000134
135. 河西专家门诊护士站 - 100000135
136. 河西妇科护士站 - 100000136
137. 河西产科护士站 - 100000137
138. 河西妇科手术登记室 - 100000138
139. 河西五官科护士站 - 100000139
140. 河西口腔科护士站 - 100000140
141. 河西内镜中心护士站 - 100000141
142. 河西住院收费处 - 100000142
143. 河西住院药房 - 100000143
144. 河西体检中心护士站 - 100000144
145. 河西体检中心团接室 - 100000145
146. 河西日间病房护士站 - 100000146
147. 河西总值班 - 100000147
148. 心内科3205区护士站 - 100000148
149. 心胸外科3206区护士站 - 100000149
150. 甲乳外科3207区护士站 - 100000150
151. 普外科3208区区护士站 - 100000151
152. （普外）3209区护士站 - 100000152
153. （骨科）3209区护士站 - 100000153
154. 骨科3210区护士站 - 100000154
155. 神经内科3211区护士站 - 100000155
156. 消化内科3505区护士站 - 100000156
157. 呼吸内科3506区护士站 - 100000157
158. 河西ICU护士站1 - 100000158
159. 河西ICU医生办公室 - 100000159
160. 河西食堂订餐 - 100000160
161. 河西护工办（3#楼负一层） - 100000161
162. 河西病案室 - 100000162
163. 南院门诊服务台 - 100000163
164. 南院门诊药房 - 100000164
165. 南院抢救室 - 100000165
166. 南院注射室 - 100000166
167. 全科医学科2204区护士站 - 100000167
168. 康复科2205区护士站 - 100000168
169. 康复科2206区护士站 - 100000169
170. 内分泌2207区护士站 - 100000170
171. 内分泌2208区护士站 - 100000171
172. 内分泌2209区护士站 - 100000172
173. 南院放射科登记处 - 100000173
174. 南院出入院结账处 - 100000174"""

from business_scene.haobai.hospital.text_embedding_v4 import get_text_embedding

department_map = []
split_indices = indices.split("\n")
for index in split_indices:
    department_name = index.split(". ")[1].split(" - ")[0]
    embedding = get_text_embedding(department_name)
    department_map.append([department_name, embedding])

with open("department_map.txt", "w", encoding="utf-8") as f:
    # 直接写入列表的字符串形式
    f.write(str(department_map))






