
jiyue_rules = {
    "特邀老用户专享/流量扩容10GB/24个月": {
        "100元（含100元）处理范围": "全省可处理100元（含100元）的违约金",
        "超过100元处理范围": "无锡、镇江、南通、盐城、淮安、常州、泰州、连云港、徐州、扬州可集约处理。"
    },
    "VIP用户流量扩容合约/5G/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无锡、镇江、南通、盐城、淮安、常州、泰州、徐州、扬州可集约处理。"
    },
    "特邀老用户专享/流量扩容1GB/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无锡、镇江、徐州、连云港、扬州、泰州可集约处理。"
    },
    "特邀老用户专享/流量扩容5GB/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无锡、镇江、连云港、扬州、泰州客户可集约处理。"
    },
    "特邀老用户专享/通话时长扩容50分钟/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无锡、镇江、连云港、扬州、泰州客户可集约处理。"
    },
    "5G-199以下档副卡含10G流量": {
        "100元（含100元）处理范围": "除连云港、宿迁，其余分公司可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-199档及以上副卡含20G流量": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "20元综合视频5G升级包": {
        "100元（含100元）处理范围": "徐州、宿迁、连云港、扬州、无锡、泰州可集约处理 。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "30元综合视频流量特惠包": {
        "100元（含100元）处理范围": "徐州、扬州、泰州可集约处理 。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "20元综合视频流量特惠包": {
        "100元（含100元）处理范围": "徐州、扬州、泰州、常州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "畅享扩容20GB-24个月": {
        "100元（含100元）处理范围": "无锡、镇江、扬州、泰州客户可集约处理 。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户回馈10G流量包": {
        "100元（含100元）处理范围": "无锡、镇江、连云港、扬州、徐州、泰州客户可集约处理 。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "应用辅导体验流量包5G/月": {
        "100元（含100元）处理范围": "徐州、宿迁、镇江、连云港、扬州、泰州，无锡（仅处理受理渠道为“免短信提醒业务操作渠道”），可集约处理 。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "9.9元专享5G升级包": {
        "100元（含100元）处理范围": "徐州、宿迁、镇江、扬州、泰州，无锡（仅处理受理渠道为“免短信提醒业务操作渠道”），可集约处理； ",
        "超过100元处理范围": "无特殊处理规定"
    },
    "特邀用户4升5/叠加20G/24个月": {
        "100元（含100元）处理范围": "无锡、 镇江、扬州、盐城、淮安、常州、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP客户20G/月本地流量包（24个月）": {
        "100元（含100元）处理范围": "镇江、扬州、徐州、无锡、泰州可集约处理，其余派分公司处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP用户流量扩容合约/1元5G/24个月": {
        "100元（含100元）处理范围": "镇江、扬州、无锡、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "今日头条定向流量包19元（连续包月）": {
        "100元（含100元）处理范围": "宿迁、镇江、扬州、无锡、徐州、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP用户流量扩容合约/1G/24个月": {
        "100元（含100元）处理范围": "无锡、镇江、扬州、徐州、泰州客户可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP老用户流量扩容合约/120G/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP客户10G/月本地流量包（24个月）": {
        "100元（含100元）处理范围": "镇江、扬州、泰州，无锡（仅处理受理渠道为“免短信提醒业务操作渠道”），可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "30元综合视频5G升级包": {
        "100元（含100元）处理范围": "徐州、扬州、无锡、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "20元综合视频5G升级包（极速版）": {
        "100元（含100元）处理范围": "徐州、连云港、扬州、无锡、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "30元综合视频5G升级包（极速版）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP副卡用户流量扩容合约/5G/24个月": {
        "100元（含100元）处理范围": "无锡、镇江、南通、盐城、淮安、常州、泰州、宿迁、扬州、徐州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "腾讯大娱乐会员+15G定向流量包": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "新办业务流量特惠包10元10GB流量/24个月": {
        "100元（含100元）处理范围": "南通、泰州、无锡、盐城、常州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "新办业务流量特惠包10元20GB流量/24个月": {
        "100元（含100元）处理范围": "南通、泰州、无锡、盐城、常州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "客户回馈特惠包折扣10元": {
        "100元（含100元）处理范围": "宿迁、连云港、扬州、无锡、徐州、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "客户回馈特惠包（20元）": {
        "100元（含100元）处理范围": "无锡、 镇江、扬州、盐城、淮安、常州、泰州、连云港、宿迁可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5元2GB通用流量升级包": {
        "100元（含100元）处理范围": "淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "客户回馈特惠包折扣20元": {
        "100元（含100元）处理范围": "无锡、镇江、南通、扬州、盐城、淮安、连云港、常州、泰州、徐州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "199及以上融合宽带签订协议提速到300M": {
        "100元（含100元）处理范围": "镇江、南通、淮安、常州、泰州、宿迁、徐州、连云港可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "399及以上融合宽带签订协议提速到1000M": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP用户签约提速至300M": {
        "100元（含100元）处理范围": "镇江、南通、淮安、常州、泰州、徐州、连云港可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP用户签约提速至500M": {
        "100元（含100元）处理范围": "镇江、南通、淮安、常州、泰州、徐州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "月付20元-宽带提速到500M": {
        "100元（含100元）处理范围": "泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "199及以上融合月付30元提速到千兆": {
        "100元（含100元）处理范围": "淮安、常州、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "10年宽带网龄签约提速到300M": {
        "100元（含100元）处理范围": "徐州、宿迁、镇江、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "月付30元提速至500M": {
        "100元（含100元）处理范围": "泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "139及以上融合月付30元提速到500M": {
        "100元（含100元）处理范围": "徐州、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "月付50元提速到千兆": {
        "100元（含100元）处理范围": "泰州可集约处理\n注：仅有“月付50元提速到千兆”销售品，可集约处理；当客户办理智家礼包组合优惠，协议未到期，派分公司；\n",
        "超过100元处理范围": "无特殊处理规定"
    },
    "139及以上融合宽带签订协议提速到200M": {
        "100元（含100元）处理范围": "徐州、镇江、泰州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "299及以上融合宽带签订1年协议提速到1000M": {
        "100元（含100元）处理范围": "徐州、镇江、泰州，无锡（仅处理受理渠道为“免短信提醒业务操作渠道”），可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "3年宽带网龄签约提速到100M": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "360元档及以上包年宽带签订协议提速到50M": {
        "100元（含100元）处理范围": "徐州、镇江、连云港、无锡、泰州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "提速到1000M/3个月": {
        "100元（含100元）处理范围": "徐州、连云港、泰州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "VIP用户签约提速至1000M": {
        "100元（含100元）处理范围": "泰州，镇江（仅处理受理渠道为“免短信提醒业务操作渠道”）可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视尊享包（渠道）/A/20元": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视尊享包（渠道）/20元": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/60元包90天": {
        "100元（含100元）处理范围": "常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/A/60元包90天": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/10元优惠/199以上": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版会员优惠/299以上": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/200元包年": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包35元": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包（渠道）/20元": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/39元包30天": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/A/39元包30天": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/A/10元优惠/199以上": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/A/200元包年": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包渠道版/A/会员优惠/299以上": {
        "100元（含100元）处理范围": "镇江、徐州、淮安、常州、泰州、宿迁、无锡、南通、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "iTV优品影视VIP包（渠道）/A/20元": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "办理指定业务包签约/业务包每月10元折扣/24个月": {
        "100元（含100元）处理范围": "淮安、常州、镇江、泰州、扬州、无锡、徐州、盐城可集约处理。\n注：宿迁、南通客户，若需要同时退订“iTV优品影视VIP包（渠道）/A/20元”和“办理指定业务包签约/业务包每月10元折扣/24个月”两个销售品，请派分公司处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G升级10G包19元201911": {
        "100元（含100元）处理范围": "徐州主卡、泰州、宿迁、淮安、盐城、扬州、无锡可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G升级20G包29元201911": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G升级60G包49元201911": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "办理5G升级包/每月10元折扣/24个月": {
        "100元（含100元）处理范围": "徐州主卡、扬州、泰州，无锡（受理渠道为“免短信提醒业务操作渠道”）可集约处理；\n",
        "超过100元处理范围": "无特殊处理规定"
    },
    "办理5G升级包/每月20元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G升级10G包（标准包）29元201910": {
        "100元（含100元）处理范围": "淮安可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户专享优惠合约/每月30元折扣/24个月-202209": {
        "100元（含100元）处理范围": "徐州、泰州、南通、盐城、淮安、常州、宿迁、连云港、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户专享优惠合约/每月20元折扣/24个月-202209": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户专享优惠合约/每月10元折扣/24个月-202209": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐合约120/每月10元/12个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、宿迁、连云港、扬州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐折扣合约240元/每月10元折扣/24个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、宿迁、连云港、扬州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-99档合约/每月10元折扣/24个月\n畅享套餐话费折扣合约/每月10元折扣/24个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、宿迁、连云港、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐合约240/每月20元/12个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、宿迁、扬州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐折扣合约480元/每月20元折扣/24个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐折扣合约720元/每月30元折扣/24个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、扬州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户专享/99畅享合约/每月20元折扣/24个月": {
        "100元（含100元）处理范围": "泰州、南通、盐城、淮安、常州、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-99档合约/每月20元折扣/24个月\n畅享套餐话费折扣合约/每月20元折扣/24个月": {
        "100元（含100元）处理范围": "南通、盐城、淮安、常州、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-99档合约/每月30元折扣/24个月\n畅享套餐话费折扣合约/每月30元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-99档合约/每月40元折扣/24个月\n畅享套餐话费折扣合约/每月40元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-99档合约/每月50元折扣/24个月\n畅享套餐话费折扣合约/每月50元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G-199档合约/每月60元折扣/24个月": {
        "100元（含100元）处理范围": "扬州、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "手机畅享套餐折扣合约960元/每月40元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "全国流量畅享99元个人套餐/单卡版/折扣合约/每月20元折扣/12个月": {
        "100元（含100元）处理范围": "泰州、宿迁、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "亲情网折扣/每月2元/24个月": {
        "100元（含100元）处理范围": "宿迁、连云港、南通、淮安、常州、镇江、泰州、扬州、盐城可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "3元翼留言白金加约版/24个月": {
        "100元（含100元）处理范围": "无锡、盐城、淮安、连云港、常州、泰州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "幸运卡每月9元折扣/24个月": {
        "100元（含100元）处理范围": "盐城、淮安、泰州可集约处理，其余派分公公司处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "24个月协议期": {
        "100元（含100元）处理范围": "无锡可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "天翼云盘AI黄金会员价每月5元折扣/12个月": {
        "100元（含100元）处理范围": "1、徐州主卡可集约处理，副卡请派分公司处理；\n2、泰州、镇江、扬州、无锡可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "天翼云盘AI黄金会员价每月5元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "天翼云盘AI铂金会员价每月10元折扣/24个月": {
        "100元（含100元）处理范围": "\n泰州、镇江、扬州、无锡、徐州可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "天翼云盘AI铂金会员价每月10元折扣/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "天翼云盘AI黄金会员加约版5元/24个月": {
        "100元（含100元）处理范围": "南通、连云港、泰州、无锡、盐城、徐州、淮安、常州、宿迁可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99（个人）套餐折扣合约/每月70元折扣/24个月": {
        "100元（含100元）处理范围": "无锡、淮安、盐城、常州、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99（个人）套餐折扣合约/每月60元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99（个人）套餐折扣合约/每月50元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99套餐折扣合约/每月30元折扣/24个月": {
        "100元（含100元）处理范围": "无锡、淮安、盐城、常州、连云港、扬州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99融合套餐折扣合约/每月25元折扣/24个月": {
        "100元（含100元）处理范围": "无锡、淮安、盐城、常州、扬州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "政企团购畅享99套餐折扣合约/每月35元折扣/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "7天全天云回看月包": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "30天全天云回看月包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "1天全天云回看月包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "折扣合约60元/每月10元折扣/6个月\n直连卫星基础销售品\n直连卫星功能": {
        "100元（含100元）处理范围": "镇江、扬州、徐州、泰州、常州，无锡“免短信提醒业务操作渠道”可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选抖音流量包（合作版）": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选基础特惠包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选流量包（合作版）/3个月协议优惠": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选基础特惠包合约版/15元/6个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "5G定向流量+会员N选1”促销至12元/月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选基础特惠包合约版/15元/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选基础特惠包合约版/15元/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选15元版促销(在网两年，优惠至10元/月)": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "老用户专享/享10元购会员随心选15元版/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15G定向流量+会员N选1”促销至15.9元/月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心用轻享版/24个月优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心用乐享版/24个月优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选15元版促销(在网一年，优惠至10元/月)": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "特邀老用户专享/会员随心选优惠/24个月": {
        "100元（含100元）处理范围": "徐州、连云港、扬州、泰州，无锡（仅处理受理渠道为“免短信提醒业务操作渠道”）可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠包标准版/24个月": {
        "100元（含100元）处理范围": "淮安、徐州、扬州、泰州可集约处理。\n注：若在退订“随心选及综合流量特惠包标准版/24个月”销售品时，需同步退订其他未集约处理的合约销售品，请派分公司处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠包尊享版/24个月": {
        "100元（含100元）处理范围": "徐州、扬州、泰州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠包标准版/12个月": {
        "100元（含100元）处理范围": "扬州、无锡、徐州、泰州可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠包尊享版/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠5G升级包标准版/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠5G升级包（极速版）标准版/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠5G升级包尊享版/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "随心选及综合流量特惠5G升级包（极速版）尊享版/24个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选校园版": {
        "100元（含100元）处理范围": "南通 、连云港 、泰州、无锡、 盐城、徐州、淮安、常州集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "24.9元包月5G通用流量+会员权益包": {
        "100元（含100元）处理范围": "淮安、常州、镇江、泰州、扬州、盐城、无锡可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15元5G定向流量+会员N选1": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "会员随心选基础特惠包/3个月减免优惠": {
        "100元（含100元）处理范围": "泰州、淮安、常州、扬州、盐城、无锡可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "3元权益包": {
        "100元（含100元）处理范围": "泰州、镇江、常州、淮安、无锡、徐州、南通、扬州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "10元权益包": {
        "100元（含100元）处理范围": "泰州、镇江、常州、淮安、无锡、徐州、南通、扬州可集约处理；",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15元通信助理流量特惠包/12个月、通信助理尊享版": {
        "100元（含100元）处理范围": "全省可处理100元（含100元）的违约金",
        "超过100元处理范围": "超过100元，若由分公司开通，扬州可集约处理，其他分公司请派单；若为全渠道开通，则根据“关于省内线上订购销售品退订并减免违约的处理流程”进行处理。"
    },
    "15元通信助理本地流量特惠包/12个月、通信助理尊享版": {
        "100元（含100元）处理范围": "省号百授权可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "翼彩纷呈特惠包5元/协议期12个月": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "翼彩纷呈通信服务包（视频彩铃+通信助理）-2021": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "乐享4G特惠包/通信助理/特惠2元": {
        "100元（含100元）处理范围": "南通、连云港、泰州 、无锡、盐城、徐州、常州、宿迁可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "新版10元5G通信服务包（视频彩铃+通信助理+来电名片）": {
        "100元（含100元）处理范围": "南通 、泰州、无锡、 盐城、徐州、常州集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15元视频彩铃流量特惠包/12个月": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "电力权益包标准版/24个月优惠合约": {
        "100元（含100元）处理范围": "无锡、盐城、常州可集约处理，其余派分公司。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "电力权益包标准版/12个月优惠合约": {
        "100元（含100元）处理范围": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
        "超过100元处理范围": "无特殊处理规定"
    },
    "电力权益包合作版/6个月优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "车主权益包标准版（6个月）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "车主权益包标准版（24个月）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "橙翼出行权益包(合作版)/6个月优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "橙翼出行权益包基础版/24个月优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "真荟选权益包（合作版）/合约优惠6个月": {
        "100元（含100元）处理范围": "省号百授权可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "爱奇艺视频会员+15G定向流量包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15.9元芒果TV会员+10GB定向流量包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "优酷视频会员+15G定向流量包": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "腾讯视频会员2GB通用流量包促销（6个月合约）、腾讯视频会员权益2GB通用流量包（6个月合约）": {
        "100元（含100元）处理范围": "可集约处理",
        "超过100元处理范围": "无特殊处理规定"
    },
    "优酷会员2GB通用流量包促销（6个月合约）、优酷会员2GB通用流量包（6个月合约）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "爱奇艺会员权益2GB通用流量包（6个月合约）、爱奇艺会员权益2GB通用流量包促销（6个月合约）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "网易云音乐会员2GB通用流量包促销（6个月合约）、网易云音乐会员2GB通用流量包（6个月合约）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "喜马拉雅会员+6GB定向流量优惠合约": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "优酷会员权益2GB通用流量包（连续包月）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "哔哩哔哩会员权益2GB通用流量包（连续包月）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "芒果TV会员权益2GB通用流量包（连续包月）": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    },
    "15元通信助理流量特惠包/12个月": {
        "100元（含100元）处理范围": "无特殊处理规定",
        "超过100元处理范围": "无特殊处理规定"
    }
}
jiyue_sales = ['特邀老用户专享/流量扩容10GB/24个月',
 'VIP用户流量扩容合约/5G/24个月',
 '特邀老用户专享/流量扩容1GB/24个月',
 '特邀老用户专享/流量扩容5GB/24个月',
 '特邀老用户专享/通话时长扩容50分钟/24个月',
 '5G-199以下档副卡含10G流量',
 '5G-199档及以上副卡含20G流量',
 '20元综合视频5G升级包',
 '30元综合视频流量特惠包',
 '20元综合视频流量特惠包',
 '畅享扩容20GB-24个月',
 '老用户回馈10G流量包',
 '应用辅导体验流量包5G/月',
 '9.9元专享5G升级包',
 '特邀用户4升5/叠加20G/24个月',
 'VIP客户20G/月本地流量包（24个月）',
 'VIP用户流量扩容合约/1元5G/24个月',
 '今日头条定向流量包19元（连续包月）',
 'VIP用户流量扩容合约/1G/24个月',
 'VIP老用户流量扩容合约/120G/12个月',
 'VIP客户10G/月本地流量包（24个月）',
 '30元综合视频5G升级包',
 '20元综合视频5G升级包（极速版）',
 '30元综合视频5G升级包（极速版）',
 'VIP副卡用户流量扩容合约/5G/24个月',
 '腾讯大娱乐会员+15G定向流量包',
 '新办业务流量特惠包10元10GB流量/24个月',
 '新办业务流量特惠包10元20GB流量/24个月',
 '客户回馈特惠包折扣10元',
 '客户回馈特惠包（20元）',
 '5元2GB通用流量升级包',
 '客户回馈特惠包折扣20元',
 '199及以上融合宽带签订协议提速到300M',
 '399及以上融合宽带签订协议提速到1000M',
 'VIP用户签约提速至300M',
 'VIP用户签约提速至500M',
 '月付20元-宽带提速到500M',
 '199及以上融合月付30元提速到千兆',
 '10年宽带网龄签约提速到300M',
 '月付30元提速至500M',
 '139及以上融合月付30元提速到500M',
 '月付50元提速到千兆',
 '139及以上融合宽带签订协议提速到200M',
 '299及以上融合宽带签订1年协议提速到1000M',
 '3年宽带网龄签约提速到100M',
 '360元档及以上包年宽带签订协议提速到50M',
 '提速到1000M/3个月',
 'VIP用户签约提速至1000M',
 'iTV优品影视尊享包（渠道）/A/20元',
 'iTV优品影视尊享包（渠道）/20元',
 'iTV优品影视VIP包渠道版/60元包90天',
 'iTV优品影视VIP包渠道版/A/60元包90天',
 'iTV优品影视VIP包渠道版/10元优惠/199以上',
 'iTV优品影视VIP包渠道版会员优惠/299以上',
 'iTV优品影视VIP包渠道版/200元包年',
 'iTV优品影视VIP包35元',
 'iTV优品影视VIP包（渠道）/20元',
 'iTV优品影视VIP包渠道版/39元包30天',
 'iTV优品影视VIP包渠道版/A/39元包30天',
 'iTV优品影视VIP包渠道版/A/10元优惠/199以上',
 'iTV优品影视VIP包渠道版/A/200元包年',
 'iTV优品影视VIP包渠道版/A/会员优惠/299以上',
 'iTV优品影视VIP包（渠道）/A/20元',
 '办理指定业务包签约/业务包每月10元折扣/24个月',
 '5G升级10G包19元201911',
 '5G升级20G包29元201911',
 '5G升级60G包49元201911',
 '办理5G升级包/每月10元折扣/24个月',
 '办理5G升级包/每月20元折扣/24个月',
 '5G升级10G包（标准包）29元201910',
 '老用户专享优惠合约/每月30元折扣/24个月-202209',
 '老用户专享优惠合约/每月20元折扣/24个月-202209',
 '老用户专享优惠合约/每月10元折扣/24个月-202209',
 '手机畅享套餐合约120/每月10元/12个月',
 '手机畅享套餐折扣合约240元/每月10元折扣/24个月',
 '5G-99档合约/每月10元折扣/24个月\n畅享套餐话费折扣合约/每月10元折扣/24个月',
 '手机畅享套餐合约240/每月20元/12个月',
 '手机畅享套餐折扣合约480元/每月20元折扣/24个月',
 '手机畅享套餐折扣合约720元/每月30元折扣/24个月',
 '老用户专享/99畅享合约/每月20元折扣/24个月',
 '5G-99档合约/每月20元折扣/24个月\n畅享套餐话费折扣合约/每月20元折扣/24个月',
 '5G-99档合约/每月30元折扣/24个月\n畅享套餐话费折扣合约/每月30元折扣/24个月',
 '5G-99档合约/每月40元折扣/24个月\n畅享套餐话费折扣合约/每月40元折扣/24个月',
 '5G-99档合约/每月50元折扣/24个月\n畅享套餐话费折扣合约/每月50元折扣/24个月',
 '5G-199档合约/每月60元折扣/24个月',
 '手机畅享套餐折扣合约960元/每月40元折扣/24个月',
 '全国流量畅享99元个人套餐/单卡版/折扣合约/每月20元折扣/12个月',
 '亲情网折扣/每月2元/24个月',
 '3元翼留言白金加约版/24个月',
 '幸运卡每月9元折扣/24个月',
 '24个月协议期',
 '天翼云盘AI黄金会员价每月5元折扣/12个月',
 '天翼云盘AI黄金会员价每月5元折扣/24个月',
 '天翼云盘AI铂金会员价每月10元折扣/24个月',
 '天翼云盘AI铂金会员价每月10元折扣/12个月',
 '天翼云盘AI黄金会员加约版5元/24个月',
 '政企团购畅享99（个人）套餐折扣合约/每月70元折扣/24个月',
 '政企团购畅享99（个人）套餐折扣合约/每月60元折扣/24个月',
 '政企团购畅享99（个人）套餐折扣合约/每月50元折扣/24个月',
 '政企团购畅享99套餐折扣合约/每月30元折扣/24个月',
 '政企团购畅享99融合套餐折扣合约/每月25元折扣/24个月',
 '政企团购畅享99套餐折扣合约/每月35元折扣/24个月',
 '7天全天云回看月包',
 '30天全天云回看月包',
 '1天全天云回看月包',
 '折扣合约60元/每月10元折扣/6个月\n直连卫星基础销售品\n直连卫星功能',
 '会员随心选抖音流量包（合作版）',
 '会员随心选基础特惠包',
 '会员随心选流量包（合作版）/3个月协议优惠',
 '会员随心选基础特惠包合约版/15元/6个月',
 '5G定向流量+会员N选1”促销至12元/月',
 '会员随心选基础特惠包合约版/15元/12个月',
 '会员随心选基础特惠包合约版/15元/24个月',
 '会员随心选15元版促销(在网两年，优惠至10元/月)',
 '老用户专享/享10元购会员随心选15元版/12个月',
 '15G定向流量+会员N选1”促销至15.9元/月',
 '随心用轻享版/24个月优惠合约',
 '随心用乐享版/24个月优惠合约',
 '会员随心选15元版促销(在网一年，优惠至10元/月)',
 '特邀老用户专享/会员随心选优惠/24个月',
 '随心选及综合流量特惠包标准版/24个月',
 '随心选及综合流量特惠包尊享版/24个月',
 '随心选及综合流量特惠包标准版/12个月',
 '随心选及综合流量特惠包尊享版/12个月',
 '随心选及综合流量特惠5G升级包标准版/24个月',
 '随心选及综合流量特惠5G升级包（极速版）标准版/24个月',
 '随心选及综合流量特惠5G升级包尊享版/24个月',
 '随心选及综合流量特惠5G升级包（极速版）尊享版/24个月',
 '会员随心选校园版',
 '24.9元包月5G通用流量+会员权益包',
 '15元5G定向流量+会员N选1',
 '会员随心选基础特惠包/3个月减免优惠',
 '3元权益包',
 '10元权益包',
 '15元通信助理流量特惠包/12个月、通信助理尊享版',
 '15元通信助理本地流量特惠包/12个月、通信助理尊享版',
 '翼彩纷呈特惠包5元/协议期12个月',
 '翼彩纷呈通信服务包（视频彩铃+通信助理）-2021',
 '乐享4G特惠包/通信助理/特惠2元',
 '新版10元5G通信服务包（视频彩铃+通信助理+来电名片）',
 '15元视频彩铃流量特惠包/12个月',
 '电力权益包标准版/24个月优惠合约',
 '电力权益包标准版/12个月优惠合约',
 '电力权益包合作版/6个月优惠合约',
 '车主权益包标准版（6个月）',
 '车主权益包标准版（24个月）',
 '橙翼出行权益包(合作版)/6个月优惠合约',
 '橙翼出行权益包基础版/24个月优惠合约',
 '真荟选权益包（合作版）/合约优惠6个月',
 '爱奇艺视频会员+15G定向流量包',
 '15.9元芒果TV会员+10GB定向流量包',
 '优酷视频会员+15G定向流量包',
 '腾讯视频会员2GB通用流量包促销（6个月合约）、腾讯视频会员权益2GB通用流量包（6个月合约）',
 '优酷会员2GB通用流量包促销（6个月合约）、优酷会员2GB通用流量包（6个月合约）',
 '爱奇艺会员权益2GB通用流量包（6个月合约）、爱奇艺会员权益2GB通用流量包促销（6个月合约）',
 '网易云音乐会员2GB通用流量包促销（6个月合约）、网易云音乐会员2GB通用流量包（6个月合约）',
 '喜马拉雅会员+6GB定向流量优惠合约',
 '优酷会员权益2GB通用流量包（连续包月）',
 '哔哩哔哩会员权益2GB通用流量包（连续包月）',
 '芒果TV会员权益2GB通用流量包（连续包月）',
 '15元通信助理流量特惠包/12个月']

nanjing_jiyue_products = [
    "5G-99档合约/每月10元折扣/24个月畅享套餐话费折扣合约/每月10元折扣/24个月",
    "5G-99档合约/每月20元折扣/24个月畅享套餐话费折扣合约/每月20元折扣/24个月",
    "5G-99档合约/每月30元折扣/24个月畅享套餐话费折扣合约/每月30元折扣/24个月",
    "5G-99档合约/每月40元折扣/24个月畅享套餐话费折扣合约/每月40元折扣/24个月",
    "5G-99档合约/每月50元折扣/24个月畅享套餐话费折扣合约/每月50元折扣/24个月",
    "畅享套餐话费折扣合约/每月120元折扣/24个月",
    "畅享套餐话费折扣合约/每月150元折扣/24个月",
    "畅享套餐话费折扣合约/每月100元折扣/24个月",
    "畅享套餐话费折扣合约/每月180元折扣/24个月",
    "畅享套餐话费折扣合约/每月90元折扣/24个月",
    "畅享套餐话费折扣合约/每月70元折扣/24个月",
    "畅享套餐话费折扣合约/每月60元折扣/24个月",
    "5G畅享续展特惠礼包",
    "5G心享续展特惠礼包",
    "5G精选续展特惠礼包",
    "5G优享续展特惠礼包",
    "5G尊享续展特惠礼包",
    "5G豪华续展特惠礼包"
]
suzhou_jiyue_products = [
    "政企团购畅享99（个人）套餐折扣合约/每月70元折扣/24个月",
    "政企团购畅享99（个人）套餐折扣合约/每月60元折扣/24个月",
    "政企团购畅享99（个人）套餐折扣合约/每月50元折扣/24个月",
    "政企团购畅享99套餐折扣合约/每月30元折扣/24个月",
    "政企团购畅享99融合套餐折扣合约/每月25元折扣/24个月",
    "政企团购畅享99套餐折扣合约/每月35元折扣/24个月",
    "老用户专享优惠合约/每月30元折扣/24个月-202209",
    "老用户专享优惠合约/每月20元折扣/24个月-202209",
    "老用户专享优惠合约/每月10元折扣/24个月-202209",
    "手机畅享套餐合约120/每月10元/12个月",
    "手机畅享套餐折扣合约240元/每月10元折扣/24个月",
    "5G-99档合约/每月10元折扣/24个月畅享套餐话费折扣合约/每月10元折扣/24个月",
    "手机畅享套餐合约240/每月20元/12个月",
    "手机畅享套餐折扣合约480元/每月20元折扣/24个月",
    "手机畅享套餐折扣合约720元/每月30元折扣/24个月",
    "老用户专享/99畅享合约/每月20元折扣/24个月",
    "5G-99档合约/每月20元折扣/24个月畅享套餐话费折扣合约/每月20元折扣/24个月",
    "5G-99档合约/每月30元折扣/24个月畅享套餐话费折扣合约/每月30元折扣/24个月",
    "5G-99档合约/每月40元折扣/24个月畅享套餐话费折扣合约/每月40元折扣/24个月",
    "5G-99档合约/每月50元折扣/24个月畅享套餐话费折扣合约/每月50元折扣/24个月"
]

nanjing_not_intensive = [
    "随心选及综合流量特惠包标准版/12个月",
    "创新业务-翼彩纷呈包（新）",
    "创新业务-天翼云盘黄金会员",
    "创新业务-天翼云盘铂金会员",
    "创新业务-权益业务/会员随心选",
    "创新业务-权益业务/本地权益轻享包",
    "创新业务-权益业务/本地权益乐享版",
    "创新业务-权益业务/ 综合视频包标准版",
    "创新业务-iTV优品影视尊享包/A",
    "VoLTE量子密话业务功能包—9元包",
    "VoLTE量子密话业务功能包—6元包",
    "VoLTE量子密话业务功能包—3元包",
    "月付50元提速到千兆",
    "月付30元提速至500M",
    "月付20元-宽带提速到500M",
    "月付20元-宽带提速到300M",
    "3元权益包",
    "24个月协议期",
    "30元特惠通信包",
    "20元特惠通信包",
    "10元权益包",
    "政企团购畅享99套餐折扣合约/每月35元折扣/24个月",
    "政企团购畅享99套餐折扣合约/每月30元折扣/24个月",
    "政企团购畅享99融合套餐折扣合约/每月25元折扣/24个月",
    "政企团购畅享99（个人）套餐折扣合约/每月70元折扣/24个月",
    "政企团购畅享99（个人）套餐折扣合约/每月60元折扣/24个月",
    "政企团购畅享99（个人）套餐折扣合约/每月50元折扣/24个月"
]
suzhou_not_intensive = [
    "随心选及综合流量特惠包标准版/12个月",
    "创新业务-天翼云盘黄金会员",
    "创新业务-天翼云盘铂金会员",
    "创新业务-权益业务/会员随心选",
    "创新业务-权益业务/本地权益轻享包",
    "创新业务-权益业务/本地权益乐享版",
    "创新业务-权益业务/ 综合视频包标准版",
    "创新业务-iTV优品影视尊享包/A",
    "VoLTE量子密话业务功能包—9元包",
    "VoLTE量子密话业务功能包—6元包",
    "VoLTE量子密话业务功能包—3元包",
    "30元特惠通信包",
    "20元特惠通信包",
    "10元权益包"
]

ruyi_package_city = {
    "真荟选权益包（合作版）/合约优惠6个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "天翼云盘黄金会员每月5元/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "连云港天翼云盘铂金会员每月10元/24个月": "连云港",
    "天翼云盘铂金会员10元/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "天翼云盘铂金会员每月10元/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "天翼云盘黄金会员+10GB本地流量礼包": "盐城、常州、无锡、南通、连云港、宿迁、泰州、徐州、淮安可集约处理。",
    "HA-天翼云盘黄金会员+10GB本地流量礼包": "淮安",
    "高清网络电视-影视尊享包20元/24个月特惠包（省广电）": "泰州、淮安、常州、扬州、无锡",
    "会员随心选视频流量包（合作版）/3个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "会员随心选基础特惠包合约版/15元/6个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "会员随心选基础特惠包合约版/15元/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "会员随心选基础特惠包合约版/15元/24个月": "盐城、常州、无锡、南通、连云港、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "盐城-会员随心选基础特惠包24个月": "盐城",
    "会员随心选及综合流量特惠包标准版/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "随心选及综合流量特惠包标准版20元/月": "连云港",
    "WX-天翼-随心选及综合流量特惠包标准版-20档": "无锡",
    "会员随心选抖音流量包（合作版）/3个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "SQ-会员随心选基础特惠包合约版/15元/24个月": "宿迁",
    "TZ-会员随心选基础特惠包合约版/15元/24个月": "泰州",
    "WX-天翼-随心选及综合流量特惠包尊享版-30档": "无锡",
    "WX-天翼-随心选合约版-15档": "无锡",
    "会员随心选/合约优惠24个月/前3月减免": "泰州、淮安、常州、扬州、盐城、无锡",
    "15元通信助理流量特惠包/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "HA-15元通信助理流量特惠包/12个月": "淮安",
    "15元通信助理本地流量特惠包/12月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "15元视频彩铃流量特惠包/12个月": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "电力权益包标准版/12个月优惠合约": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "电力权益包合作版/6个月优惠合约": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "电力权益包标准版/24个月优惠合约": "无锡、盐城、常州",
    "随心用轻享版/24个月合约": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "随心用乐享版/24个月合约": "盐城、常州、无锡、南通、连云港、宿迁、扬州、泰州、镇江、徐州、淮安可集约处理。",
    "随心选及综合流量特惠包尊享版/12个月": "盐城、常州、无锡"
}
ruyi_sales = ['真荟选权益包（合作版）/合约优惠6个月',
 '天翼云盘黄金会员每月5元/12个月',
 '连云港天翼云盘铂金会员每月10元/24个月',
 '天翼云盘铂金会员10元/12个月',
 '天翼云盘铂金会员每月10元/12个月',
 '天翼云盘黄金会员+10GB本地流量礼包',
 'HA-天翼云盘黄金会员+10GB本地流量礼包',
 '高清网络电视-影视尊享包20元/24个月特惠包（省广电）',
 '会员随心选视频流量包（合作版）/3个月',
 '会员随心选基础特惠包合约版/15元/6个月',
 '会员随心选基础特惠包合约版/15元/12个月',
 '会员随心选基础特惠包合约版/15元/24个月',
 '盐城-会员随心选基础特惠包24个月',
 '会员随心选及综合流量特惠包标准版/12个月',
 '随心选及综合流量特惠包标准版20元/月',
 'WX-天翼-随心选及综合流量特惠包标准版-20档',
 '会员随心选抖音流量包（合作版）/3个月',
 'SQ-会员随心选基础特惠包合约版/15元/24个月',
 'TZ-会员随心选基础特惠包合约版/15元/24个月',
 'WX-天翼-随心选及综合流量特惠包尊享版-30档',
 'WX-天翼-随心选合约版-15档',
 '会员随心选/合约优惠24个月/前3月减免',
 '15元通信助理流量特惠包/12个月',
 'HA-15元通信助理流量特惠包/12个月',
 '15元通信助理本地流量特惠包/12月',
 '15元视频彩铃流量特惠包/12个月',
 '电力权益包标准版/12个月优惠合约',
 '电力权益包合作版/6个月优惠合约',
 '电力权益包标准版/24个月优惠合约',
 '随心用轻享版/24个月合约',
 '随心用乐享版/24个月合约',
 '随心选及综合流量特惠包尊享版/12个月']
