
# 下派场景
company_scene = [
    "客户登记赠送免费 /**G 流量",
    "电信机房、设备相关问题",
    "营业厅业务办理问题：业务漏受理、办理差错、解释说明不清（必须提及营业厅）",
    "接到 10000 号营销电话争议（剔除外呼工号 30839、38开头、36、31、30开头派省层面）",
    "政企客户对本金 + 滞纳金欠费不认可",
    "涉及营业厅、装维、线下门店相关投诉问题",
    "网络质量类：网速慢、信号差、网络不稳定",
    "含智慧家 / 智家 / ACAP / 面板 / 终端 / 中屏 / 门锁 / 子母路由 / 银行保证 / CFQ / 橙分期的否认办业务、违约金争议",
    "涉及宽带及路由器安装咨询、投诉",
    "固话 / 宽带 /iTV/ 手机无法正常使用（断网、故障、宽带网速异常等）",
    "固话号码二次放号相关问题",
    "要求取消 VPN 业务",
    "否认办理号码，且工单明确表示在渠营业厅申请办理，则派至分公司（若无法判断办理渠道，则派至省层面）",
    "智慧学生证（中小学）手机卡 相关问题",
    "苏州、南京客户对开通“10权益包”开通不认可或违约金争议",
    "关于设备赔偿的争议",
    "客户要求办理主副卡分离。",
    "关于虚拟网、VPN问题争议。",
    "宿迁客户对老号码不支持加入共享卡（副卡）有争议。",
    "客户要求免费提速、免费提供千兆路由器",
    "电信机房、设备相关问题（补充：路由器、摄像头）",
    "智慧家 / 智家 / ACAP / 面板 / 终端 / 中屏 / 门锁 / 子母路由 / 银行保证 / CFQ / 橙分期的否认办业务、违约金争议/(补充：全屋WIFI相关争议）",
    "主副卡分离、主副卡拆分、要求副卡单独变更套餐",
    """客户要求恢复原套餐争议。
1、南京、镇江派省投诉中心
2、连云港、泰州、宿迁派分公司；
3、徐州、淮安、南通、盐城、常州、苏州、扬州、无锡
1）若恢复的是“全国流量畅享79元个人套餐、全国流量畅享199元个人套餐、全国流量畅享199元融合套餐、全国大流量套餐19元、全国大流量套餐39元、星卡19元档、星卡39元档、星卡69元档、十全十美畅享199元/200M/无合约版；苏州除了星卡39元档销售品”则流向省投诉中心；
2）除以上套餐派给分公司。
    """,
    "客户表示安装/移机未完成，但实际系统显示已完成。"
]

# 不下派场景
province_scene = [
    "流量包收费争议（含国际漫游多天畅享流量包，不含权益类流量包；含否认 / 不知情订购流量包）",
    "流量超出费用有争议",
    "达量降速套餐超出收费争议",
    "增值业务费用争议：WAP 信息费、视频彩铃、漏话提醒 + 彩铃优惠包、旺铺助手、诚信通、云管家、天翼游戏信息",
    "ITV 开机广告不认可",
    "ITV 点播费用有争议",
    "江苏电信微信小程序、中国电信 APP、天翼生活 APP、中国电信客户端相关问题",
    "受理理内容含【掌上营业厅 52】、【10000 自动受理 (地市名)】的投诉",
    "真荟选权益包（合作版）/合约优惠6个月",
    "爱奇艺视频会员+15G定向流量包",
    "15.9元芒果TV会员+10GB定向流量包",
    "优酷视频会员+15G定向流量包",
    "腾讯视频会员2GB通用流量包促销（6个月合约）、腾讯视频会员权益2GB通用流量包（6个月合约）",
    "优酷会员2GB通用流量包促销（6个月合约）、优酷会员2GB通用流量包（6个月合约）",
    "爱奇艺会员权益2GB通用流量包促销（6个月合约）、爱奇艺会员权益2GB通用流量包（6个月合约）",
    "网易云音乐会员2GB通用流量包促销（6个月合约）、网易云音乐会员2GB通用流量包（6个月合约）",
    "喜马拉雅会员+6GB定向流量优惠合约",
    "优酷会员权益2GB通用流量包（连续包月）",
    "哔哩哔哩会员权益2GB通用流量包（连续包月）",
    "芒果TV会员权益2GB通用流量包（连续包月）",
    "线上订单相关投诉",
    "手机号码二次放号争议（新号接前机主来电、无法注册、被标记等）",
    "国际漫游相关问题争议",
    "互联网卡相关问题",
    "服务态度争议投诉",
    "积分兑换争议（不含营业厅兑换）",
    "一号双终端业务争议",
    "客户咨询套餐内容",
    "自动续约不认可的违约金争议（全省集约）",
    "亲情宽带、跨省宽带套餐争议",
    """地域为南京，礼包为
    1、创新业务-权益业务/会员随心选6个月(线上专属)
    2、创新业务-权益业务/会员随心选12个月(线上专属)
    3、创新业务-权益业务/会员随心选连续包月（线上专属）
    4、生活福利畅心用
    5、本地生活权益欢乐享6个月（线上专属）""",
    "若为ROT SOZ开头的线上订单、抖音直播、线上换卡类订单",
    "要**人员回电，受理内容中未提及渠道或工号的，不下派",
    "增值业务费用争议：WAP 信息费、视频彩铃、漏话提醒 + 彩铃优惠包、旺铺助手、诚信通、云管家、天翼游戏信息、企宣通、云回看、安全管家增强包、乐享4G特惠包/七彩铃音/特惠2元、 通信助理互联网尊享版、有声名片8元版、漏话助理、天翼云盘AI黄金会员 、 翼彩纷呈通信服务包",
    "电子签名相关问题",
    "“遥控器丢失”",
    "流量不清零规则/超流量立即断网等流量相关的规则争议",
    "客户对通话费用不认可（包含国际长途通话费、国内通话费）",
    "客户对短信费用有争议。（包含国内短信、国际短信）",
    "客户反映天翼成长守护相关问题",
    "客户要求取消上网功能",
    "客户对老号码不支持加入共享卡（副卡）有争议。除宿迁外其它地市不下派",
    "流量包/语音包/短信包开通争议",
    "增值业务费用争议：WAP 信息费、视频彩铃、漏话提醒 + 彩铃优惠包、旺铺助手、诚信通、云管家、天翼游戏信息、企宣通、云回看、安全管家增强包、乐享4G特惠包/七彩铃音/特惠2元、 通信助理互联网尊享版、有声名片8元版、漏话助理、天翼云盘AI黄金会员、翼彩纷呈通信服务包",
    "客户号码要求复装争议。",
    "客户对名下号码欠费/黑名单/灰名单/涉诈停机，影响办理业务有争议。",
    "关于绿通充值相关问题",
    "客户号码欠费要求紧急开机争议。",
    "关于国际漫游的问题",
    "关于实名制认证争议",
    "关于流量使用问题（包含流量使用快、未使用、流量轨迹查询）等。",
    "客户对号码欠费/号码停机有争议。",
    "客户反映关于智能语音/IVR/10000号/QQ客服/IM客服等问题",
    "关于会员权益领取的问题",
    "关于过户的问题",
    "客户对电信私网IP无法更改为公网IP有争议。",
    "充错话费争议"
]

from business_scene.suzhiban.utils.utils import judge_whether_contain_complaint_type

def front_complaint(complaint_content):
    unmatchment =judge_whether_contain_complaint_type(complaint_content, province_scene)
    if unmatchment:
        return "集约", unmatchment
    unmatchment = judge_whether_contain_complaint_type(complaint_content, company_scene)
    if unmatchment:
        return "不集约", unmatchment
    return "无法判断", ''